Revit 2024 API
StairsSupportTopsideSurfaceType Enumeration
 The style of the topside surface of the support.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum StairsSupportTopsideSurfaceType
Visual Basic
Public Enumeration StairsSupportTopsideSurfaceType
Visual C++
public enum class StairsSupportTopsideSurfaceType
Members
Member name | Description
Closed |  The style of the topside surface of the support is closed.
Open |  The style of the topside surface of the support is open.
See Also
Autodesk.Revit.DB.Architecture Namespace